import numpy as np

#广播机制 Broadcasting
#数组形状不同时，Numpy尝试自动扩展较小的数组以匹配形状，从而实现不同维度的运算



# 形状相同的数组运算
a = np.array([1, 2, 3])
b = np.array([10, 20, 30])
print(a + b)

a = np.array([[1,2,3],[4,5,6]])
b = np.array([[10,20,30],[40,50,60]])
print(a - b)


# 形状不同的数组运算
a = np.array([[1,2,3],[4,5,6]])
b = np.array([10, 20, 30])
print(a + b)
#扩维 
#1.从后像前比较各维度大小
#2.维度相等或其中一个为 1 时可兼容
#3.缺失维度在左侧补 1
#
#(2,3) 与 (3,) -> 后缘维度 3 = 3， b补为(1, 3) -> 扩展为 (2, 3)
#(3,1) 与 (1,3) -> 两者都广播为 (3, 3)
#(2,3) 与 (2,1) -> 广播为 (2,3) 成功
#(2,3) 与 (3,1) -> (2,3) = (3,3) 2,3 不能广播 (3 != 2),会报错
#  

a = np.ones((2, 3))
b = np.ones((3, 1))
print( a + b )
